Repository: giellalt/corpus-nob
Catalog: prestable/tmx/sme/facta/skuvlahistorja2/madsen-n.htm.tmx
Source language: nob
Languages: sme

source: Sámegillii
sme: På norsk

source: Artikkel i boka Samisk skolehistorie 2.
sme: Artihkal girjjis Sámi skuvlahistorjá 2.

source: Randi Nordback Madsen og Trygve Madsen:
sme: Randi Nordback Madsen ja Trygve Madsen:

source: Skolen for samer sett fra mange vinkler
sme: Skuvla sámiid várás gehččon máŋgga láhkai

source: Fortalt til Svein Lund
sme: Muitaluvvon Svein Lundii

source: Trygve og Randi Nordback Madsen foran hytta deres i Bassevuovdi, Karasjok, påska 2003.
sme: Trygve ja Randi Nordback Madsen čuččodeame barttaska ovddabealde Bassevuovddis Kárášjogas, 2003 beassážat.

source: (Foto: Svein Lund)
sme: (Govva: Svein Lund)

source: Det finnes knapt et ektepar som har så allsidige opplevelser med skolen for samiske elever som Trygve og Randi Nordback Madsen.
sme: Eai dáidde leat galle dakkár náittosguimmeža, geain leat nu iešguđetlágan vásáhusat sámi mánáid skuvlavázzimis, go Trygve Madsenis ja Randi Nordback Madsenis.

source: Til sammen representerer de erfaringer fra roller som elev, student, forelder, lærer i grunnskole og videregående skole, rektor, skoledirektør og konsulent i departementet.
sme: Sudnos leat oktiibuot vásáhusat sihke oahppin, studeantan, váhnemin, vuođđoskuvlla ja joatkkaskuvlla oahpaheaddjin, rektorin, skuvladirektevran ja departemeantta konsuleantan.

source: De har arbeida på så forskjellige steder som Kautokeino, Karasjok, Lebesby, Vadsø og Oslo.
sme: Soai leaba bargan máŋgga báikkis nugo Guovdageainnus, Kárášjogas, Davvesiiddas, Čáhcesullos ja Oslos.

source: Randi Nordback Madsen er født i 1930 og oppvokst i Follafoss i Nord-Trøndelag.
sme: Randi Nordback Madsen riegádii 1930:s ja bajásšattai Follafossas Davvi-Trøndelágas.

source: Da hun for første gang møtte samiske elever, kunne hun ikke et ord samisk.
sme: Go son vuosttaš geardde deaivvadii sámi ohppiiguin, de ii máhttán sánige sámegiela.

source: Trygve Madsen er født i 1927 og oppvokst i Kautokeino, der far hans var lærer.
sme: Trygve Madsen riegádii 1927:s ja bajásšattai Guovdageainnus, gos su áhčči lei oahpaheaddjin.

source: Hjemmespråket var norsk, men han lærte samisk fra den tidligste barndommen.
sme: Ruovttugiella lei dárogiella, muhto son oahpai sámegiela mánnán juo.

source: Vi har oppsøkt dem i hjemmet på Hønefoss i Buskerud og på hytta i Bassevuovdi i Karasjok for å få dem til å fortelle noen glimt fra det de har opplevd.
sme: Finaimet sudno galledeamen Hønefossas Buskerudas ja barttas Bassevuovddis Kárášjogas ja nu beasaimetge gullat veahá das maid soai leaba vásihan.

source: – Ingen hadde fortalt om andre språk enn norsk
sme: – Ii oktage lean muitalan eará gielaid birra go dárogiela

source: – Folkeskolen min var den gamle landsfolkeskolen, forteller Randi.
sme: – Mu álbmotskuvla lei boares giliálbmotskuvla, muitala Randi.

source: – Vi gikk annenhver dag, og på de dagene som det ikke var skole var jeg med familien i forskjellig slags arbeid, bl.a. skogplanting.
sme: – Mii vácciimet skuvlla juohke nuppi beaivvi, ja daid beivviid go ii lean skuvla, de ledjen bearrašan mielde bargamin máŋggalágan bargguid, ee. gilvviimet muoraid.

source: Etter folkeskolen ville jeg gå videre på skoler, men det var det heller lite støtte for i lokalmiljøet.
sme: Maŋŋá álbmotskuvlla, de háliidin joatkit skuvlavázzima, muhto báikkálaš birrasis lei unnán doarjja dasa.

source: Likevel kom jeg meg avgårde og tok gymnas i Oslo.
sme: Datte bessen mátkái ja gearggahin gymnása Oslos.

source: Etter gymnaset søkte jeg lærerskolen, men kom ikke inn fordi jeg var for ung.
sme: Maŋŋá gymnása ohcen oahpaheaddjiskuvlii, muhto in beassan dohko álgit go ledjen menddo nuorra.

source: Derimot fikk jeg jobb som erstatningslærer i Finnmark.
sme: Baicca bessen bargui Finnmárkui sadjásašoahpaheaddjin.

source: Det var et sjokk.
sme: – In diehtán ollenge mii mus lei vuordagis.

source: Ingen hadde fortalt meg at jeg kunne møte elever som snakket noe annet enn norsk.
sme: Ii oktage lean muitalan munnje ahte doppe sáhtán deaivvadit ohppiiguin geat hálle eará giela go dárogiela.

source: Men det viste seg at en stor del av elevene var samisktalende og norskkunnskapene var det heller skralt med.
sme: Ja čájehuvvui ahte eanaš oahppit ledje sámegielagat ja dárogiela gal máhtte unnán.

source: Jeg har etterpå lurt på om de i det hele lærte noe av meg det året jeg var der.
sme: Mun lean maŋŋá jurddašan ahte ohppe go son sii maidege dan jagi go mun ledjen doppe.

source: Dette året gjorde et enormt inntrykk.
sme: Diet jahki bisánii munnje muitui.

source: Jeg forsto at noe var bort i veggene galt, når man kunne ta artium [Examen artium = eksamen fra gymnas, studiekompetanse.
sme: Áddejin ahte juoga lei áibbas endorii, go Norggas sáhtii oažžut artiuma [Examen artium = gymnásaeksamen, dárbbašlaš eksámen beassat universitehtii.

source: Uttrykket gikk av bruk etter at Lov om videregående opplæring blei innført i 1976.] i Norge uten å få høre at det fantes landsmenn som snakket andre språk enn norsk.
sme: Vástidii sullii dálá joatkkaskuvlla oppalašfágalaš suorggi eksamenii.] gulakeahttá ahte doppe leat seamma riikka olbmot, geat hálle eará giela go dárogiela.

source: Etter et år som erstatningslærer dro Randi til lærerskolen på Levanger.
sme: Go Randi lei bargan jagi sadjásašoahpaheaddjin, de manai Levangerii oahpaheaddjiskuvlii.

source: Erfaringene fra Finnmark gjorde at hun da som særoppgave i pedagogikk skrev om opplæring for samiske elever.
sme: Finnmárkku vásáhusaidis geažil son dalle čálii pedagogihka sierrabargun sámi ohppiid oahpahusa birra.

source: Oppgaven har hun ennå tatt vare på, og når vi kommer på besøk til Hønefoss, får vi se den.
sme: Dát bargu lea sus ain áimmuin, ja go galledat su Hønefossas, de beassat geahčadit dan.

source: Ut fra at den er skrevet tidlig på 1950-tallet er det et imponerende arbeid, og et klart oppgjør med den fornorskingspolitikken som da dominerte og som hun selv hadde vært med å sette ut i livet i skolen.
sme: Go jurddaša ahte dat lea čállojuvvon 1950-logu álggogeahčen, de dat lea vuđolaš bargu, ja dat suokkardallá dáruiduhttinpolitihka mii dalle jođihuvvui ja man son ieš lei searvvis dahkamin duohtan skuvllas.

source: I oppgaven sammenligner hun lesehastighet hos elever ved skoler i Indre Finnmark og i Trøndelag.
sme: Dán barggus son buohtastahttá Sis-Finnmárkku ja Trøndelága skuvllaid ohppiid lohkanleavttu.

source: – Det var slik man tenkte den gang, sier hun nå.
sme: – Nu dalle jurddašedje, dadjá son dál.

source: – Ut fra det man nå vet om lesing og forståelse, kan man si at dette ikke ga et rett bilde.
sme: – Dan maid mii dál diehtit lohkama ja áddema birra, de sáhttá dadjat ahte dát ii addán rivttes gova.

source: Det var ikke lesehastigheten, men forståelsen som skulle vært målt.
sme: Ii leat lohkanleaktu, muhto ádden mii livččii galgan mihtiduvvot.

source: Tospråklig bare i kristendom
sme: Guovttegielalaš dušše risttalašvuođas

source: Trygve vokste opp og gikk på skole i et ganske annet miljø:
sme: Trygve šattai bajás ja váccii skuvlla áibbas eará birrasis:

source: – Foreldrene mine kom fra Salten i Nordland til Kautokeino i 1920.
sme: – Mu váhnemat fárrejedje Sálttus Guovdageidnui jagis 1920.

source: Far min, Ludvig Madsen, var lærer, mens mor var hjemme med fem barn og fjøs.
sme: Mu áhčči, Ludvig Madsen, lei oahpaheaddji, ja eadni lei ruovttus viđain mánáin ja doalai náveha.

source: Far leste samisk med presten Smith, og snakket etter hvert språket flytende.
sme: Áhčči logai sámegiela báhppa Smithain, ja hállagođii sámegiela njuovžilit.

source: Foreldrene mine ble i Kautokeino frem til evakueringa i 1944.
sme: Mu váhnen-guovttos ásaiga Guovdageainnus gitta eváhko rádjai 1944.

source: Da dro de til hjemtraktene sine i Salten.
sme: Dalle soai fárriiga ruovttuguvlui Sáltui.

source: Far fikk jobb som lærer der, og der ble de boende.
sme: Áhčči beasai oahpaheaddjin dohko, ja dohko soai ásaiduvaiga.

source: På skolen i Kautokeino hadde vi fire lærere.
sme: Guovdageainnu skuvllas mis ledje njeallje oahpaheaddji.

source: Ved siden av far var det Anders Bongo, Alfred Larsen og Marit Grønolen.
sme: Áhči lassin ledje Anders Bongo, Alfred Larsen ja Marit Grønolen.

source: Hun var den eneste av dem som ikke snakket samisk.
sme: Marit Grønolen lei áidna sis gii ii hállan sámegiela.

source: I kristendom hadde vi tospråklige bøker, både katekisme, bibelhistorie og ikke minst Bibelen.
sme: Risttalašvuođas ledje mis guovttegielalaš girjjit, sihke katekisma, biibbalhistorjá ja dieđusge Biibbal vel.

source: Vi kunne lese og si frem leksen på det språket vi ville.
sme: Mii sáhtiimet lohkat ja muitalit jitnosit ruovttubihtáid dan gillii masa háliideimmet.

source: Ellers var lærebøkene bare på norsk, men lærerne brukte mye samisk i undervisningen, i alle fall frem til 4.–5. klasse.
sme: Muđui mis ledje dušše dárogiel oahppogirjjit, muhto oahpaheaddjit geavahedje ollu sámegiela oahpahusas, ainjuo gitta 4.–5. luohká rádjai.

source: Det var ikke lett å få videre utdanning for oss som vokste opp i Indre Finnmark i den tiden.
sme: Midjiide, geat ásaimet Sis-Finnmárkkus, ii lean álki álgit joatkkaohppui dan áigge.

source: Før krigen var det bare to fra Kautokeino som fikk realskole.
sme: Ovdal soađi vácciiga dušše guovttis realskuvlla.

source: Den ene var min søster, den andre var Edel Hætta Eriksen.
sme: Nubbi lei mu oabbá, ja nubbi gis Edel Hætta Eriksen.

source: [Se Edel Hætta Eriksens fortelling i Samisk skolehistorie 1.]
sme: [Geahča Edel Hætta Eriksena muitalus, Sámi skuvlahistorjá 1.]

source: Jeg ville bli lærer, men det var ingen enkel sak å få til.
sme: Mun áigon šaddat oahpaheaddjin, muhto dat ii lean mihkkege álkes áššiid.

source: I Kautokeino fikk jeg bare 6 års folkeskole.
sme: Guovdageainnus in ožžon go 6 jagi álbmotskuvlla.

source: For å komme videre dro jeg til Trøndelag.
sme: Vai beasan joatkit, de vulgen Trøndelagii.

source: Der tok jeg handelsskolen på Levanger og et 2 måneders puggekurs ved Skogn folkehøgskole, beregnet på opptaksprøven for lærerskolen.
sme: Doppe Levangeris mun vázzen gávpeskuvlla ja Skogn álbmotallaskuvllas gis guovttemánnosaš bajilmáhttinkurssa, mii lei jurddašuvvon oahpaheaddjiskuvlii sisabeassangeahččaleami várás.

source: I tillegg tok jeg norsk og regning som korrespondansekurs mens jeg var i militæret.
sme: Dasa lassin vel čađahin dárogiela ja rehkenastima korrespondánsakurssaid go ledjen militearas.

source: Med dette kom jeg inn på 4-årig lærerskole i Levanger.
sme: Dát dagahedje ahte bessen álgit Levangerii 4-jagi oahpaheaddjiskuvlii.

source: Her traff jeg for øvrig Randi, som gikk på 2-årig linje.
sme: Doppe moai Randiin gávnnadeimme, son váccii 2-jagi suorggi.

source: Siste året på lærerskolen tok jeg også skolesanglærereksamen ved Musikkonservatoriet i Trondheim.
sme: Maŋimuš jagi oahpaheaddjiskuvllas válden maiddái skuvlalávlunoahpaheaddjieksámena Troandima Musihkkakonservatorias.

source: Fra 1953 til 1955 arbeidet Trygve Madsen som lærer i Karasjok og skoleåret 1955/56 arbeidet begge i Malm i Nord-Trøndelag.
sme: 1953 ' rájes 1955 ' rádjai Trygve barggai oahpaheaddjin Kárášjogas ja skuvlajagi 1955 barggaiga goappašagat Malmas Davvi-Trøndelágas.

source: Fra 1956 til 1958 arbeidet Trygve som programsekretær i sameradioen, som da var en del av NRK-Finnmark i Vadsø.
sme: 1956 ' rájes 1958 ' rádjai Trygve Madsen barggai prográmmačállin sámeradios, mii dalle lei oassin NRK-Finnmárkkus Čáhcesullos.

source: Der var han den første og eneste som var ansatt på full tid med ansvar for samiske sendinger.
sme: Doppe son lei vuosttaš ja áidna bargi, gii barggai ollesáiggi ja sus leige ovddasvástádus sámi sáddagiidda.

source: – Vi hadde Erling Hirsti som nyhetsoppleser, Agnes Øwre hadde husmorprogram og bror min, Erland Madsen, hadde jordbruksprogram.
sme: – Mis lei Erling Hirsti gii logai ođđasiid, Agnes Øwre ráhkadii dálueamitprográmmaid ja mu viellja Erland Madsen lágidii gis eanadoalloprográmmaid.

source: Selv hadde jeg barneprogram i tillegg til ansvar for organiseringa.
sme: Mus alddán lei mánáidprográmma lassin ovddasvástádus organiseremii.

source: Skolespørsmål var lite omtalte i programmene, vi fortalte litt om hva Samekomiteen arbeidet med, men selve innstillingen fra komiteen kom ikke før etter at jeg sluttet der.
sme: Skuvlaáššit unnán gullojedje dáin prográmmain. Mii muitaleimmet veahá das maid Sámelávdegoddi barggai, muhto lávdegotti árvalus ii boahtán ovdalgo mun heiten doppe.

source: Felles arbeidsplasser i Karasjok
sme: Oktasaš bargosajit Kárášjogas

source: Fra 1958 til 1960 var de begge ansatt ved Grensen skole i Karasjok kommune, Trygve som styrer og Randi som lærer.
sme: Áigodagas 1958-60 barggaiga goappašagat Rájá skuvllas Kárášjoga gielddas, Trygve lei jođiheaddjin ja Randi oahpaheaddjin.

source: I 1960 flyttet de til Karasjok skole på kirkestedet, der de fikk de samme rollene.
sme: 1960:s fárriiga Kárášjoga skuvlii, mii lei márkanbáikkis, doppe soai barggaiga seamma bargguid.

source: Dette var en tid med mye strid.
sme: Dát lei dakkár áigi goas ledje ollu riiddut.

source: Fornorskningspolitikerne slo ned på alt som smakte av samisk i skolen.
sme: Dáruiduhttinpolitihkkárat vašuhedje buot mii jo leaččai sámegillii gullevaš skuvllas.

source: – Jeg husker at en lærer som het Eivind Tønnesen hadde latt elevene skrive noen samiske ord, forteller Trygve.
sme: – Muittán ovtta oahpaheaddji gean namma lei Eivind Tønnesen, ja gii lei suovvan ohppiid čállit moadde sámegiel sáni, muitala Trygve.

source: – Da tok fornorskningstilhengerne det opp i skolestyret og ville at denne læreren skulle få en reprimande.
sme: – Dan gal dáruiduhttindoarjaleaddjit válde ovdan skuvlastivrras ja háliidedje ahte oahpaheaddji galggai cuiggoduvvot.

source: Så hard var fornorskingspolitikken som dominerte i kommunen.
sme: Nu garas lei dáruiduhttinpolitihkka mii dalle lei fámolaš gielddas.

source: Sang og musikk i skolen
sme: Lávlun ja musihkka skuvllas

source: Hele livet har Trygve vært interessert i sang og musikk.
sme: Olles eallima lea Trygve beroštan lávlumis ja musihkas.

source: Allerede i barndommen skaffet han seg et trekkspill, og fortsatt er han aktiv på dette instrumentet, bl.a. i Ringerike trekkspillklubb.
sme: Jo mánnán hágai geasanasa, ja ain čuojahallá dáinna čuojanasain, ee. Ringerike geasanasjoavkkus.

source: Ellers er det piano som han har spilt mest.
sme: Muđui son lea eanemusat čuojahan piano.

source: Han har komponert mange sanger og da den aller første plata med samisk sang kom ut i 50-åra, var det Marie Varsi som sang Gussavuordi med melodi av Trygve Madsen.
sme: Son lea bidjan šuoŋa máŋgga lávlagii ja go buot vuosttamuš sámi lávlunskearru ilmmai 50-logus, de lávllui Marie Varsi Gussavuordi masa Trygve Madsen lei šuoŋa bidjan.

source: Han har også oversatt en del sanger til samisk og gitt ut en tospråklig sangbok [Lávlagirji – samisk sangbok.
sme: Son lea maid jorgalan ollu lávlagiid sámegillii ja almmustahttán guovttegielalaš lávlungirjji ovttas Isak Østmoin ja Thorleif Bergain. [Lávlagirji – samisk sangbok.

source: Universitetsforlaget 1975], sammen med Isak Østmo og Thorleif Berg.
sme: Universitetsforlaget 1975] – Mii eat beassan juigosiid gal geavahišgoahtit skuvllas.

source: Hadde vi gjort det, og foreldrene fått høre det, hadde jeg fått sparken.
sme: Jos mii dan livččiimet dahkan, ja váhnemat dan gullan, de livččen lihcohallan.

source: Det vi kunne gjøre var å oversette norske sanger til samisk og å lage nye sanger.
sme: Áidna maid sáhtiimet dahkat lei heivehit dárogiel lávlagiid sámegillii ja ráhkadit ođđa lávlagiid.

source: En av de første bøkene med samiske sanger var av Pekka Lukkari.
sme: Ovtta dain vuosttaš sámegiel lávlungirjjiin doaimmahii Pekka Lukkari.

source: Den første utgaven kom i 1948, den andre i 1960.
sme: Vuosttaš girji ilmmai 1948:s, nubbi gis 1980:s.

source: Der var det fem nye sanger som vi hadde samarbeidet om.
sme: Das ledje vihtta ođđa lávlaga maiguin moai ovttasbarggaime.

source: En initiativrik musikklærer sørfra satte igang opplæring på strykeinstrumenter, og resultatet blei dette orkesteret.
sme: Hutkás ja ealljáris mátta-norgalaš musihkkaoahpaheaddji álggii streaŋgačuojanasaid čuojahanoahpahusa, ja boađus lei dát čuojahanjoavku.

source: Samisk grunnfag i Oslo
sme: Sámegiela vuođđofága Oslos

source: I 1962–63 dro både Randi og Trygve til Oslo for å studere samisk grunnfag.
sme: Áigodaga 1962–63 leigga sihke Randi ja Trygve Oslos lohkamin sámegiela vuođđofága.

source: Det var første året det ble tilbudt dette studiet i Oslo.
sme: Dalle lei vuosttaš geardde go sáhtii lohkat vuođđofága Oslos.

source: Det ble da gitt tilbud til lærere om et års studiepermisjon for å lese samisk, mot 5 års bindingstid.
sme: Oahpaheddjiide fállojuvvui jagi lohkanvirgelohpi lohkat sámegiela, ja čatnanáigi lei 5 jagi.

source: Samiskfaget var et unntak fra kravet om studiekompetanse.
sme: Dán fágii ii gáibiduvvon lohkangelbbolašvuohta.

source: Å få studiekompetanse var noe annet enn senere, det eneste som telte var eksamen fra gymnas eller examen artium som det da ble kalt.
sme: Oažžut lohkangelbbolašvuođa lei juoga eará go maŋŋá, áidna mii galggai lei gymnása eksámen dahje examen artium, manin dan dalle gohčodedje.

source: Randi hadde studiekompetanse, siden hun hadde gått gymnaset, mens Trygve ikke hadde det etter datidens regler, selv om han hadde 4-årig lærerskole og norsk mellomfag fra Norges lærerhøgskole.
sme: Randis lei lohkangelbbolašvuohta, go lei vázzán gymnása, muhto Trygves ii lean dat dalá njuolggadusaid mielde, vaikko sus lei 4-jagi oahpaheaddjiskuvla ja dárogiela gaskafága Norgga oahpaheaddjiskuvllas.

source: Samisk var derfor det eneste faget han fikk lov til å studere på universitetet.
sme: Sámegiella lei danin áidna fága maid son sáhtii lohkat universitehtas.

source: Samisklærerne var Thor Frette, Knut Bergsland og Asbjørn Nesheim.
sme: Sámegiela oahpaheaddjit ledje Thor Frette, Knut Bergsland ja Asbjørn Nesheim.

source: – De var ganske forskjellige: Frette var systematisk og teoretisk, Bergsland var nokså flygende, mens Nesheim, som hadde hovedansvar for kulturhistorien, var en veldig flink underviser.
sme: – Sii ledje iešguđetláganat: Frette lei systemáhtalaš ja teorehtalaš, Bergsland lei gis hui mohkkái ja Nesheim, geas lei váldoovddasvástádus kulturhistorjjás, lei hui čeahppi oahpahit.

source: Språkdelen var svært teoretisk grammatikk.
sme: Giellaoassi lei hui teorehtalaš giellaoahppa.

source: Blant studentene var det både folk med samisk som morsmål og folk som knapt kunne noe samisk fra før.
sme: Studeanttat ledje sihke olbmot, geain lei sámegiella eatnigiellan ja olbmot, geat eai báljo máhttán sámegiela ovdalaččas.

source: Studentene kom stort sett fra Finnmark, og faget ble kalt «Finnmarkssamisk».
sme: Eanaš studeanttat bohte Finnmárkkus, ja fága gohčoduvvui «Finnmárkku sámegiellan».

source: Undervisningen foregikk på norsk og studentene skulle og svare på norsk ved skriftlig eksamen.
sme: Oahpahus lei dárogillii ja studeanttat galge maiddái vástidit dárogillii eksámenis.

source: Blant studentene var det mange som senere skulle spille en stor rolle i samisk skole og kulturliv, som Nils og Laila Jernsletten, Thorleif Berg, Kristian Nymo, Anna Mørk og Isak Østmo.
sme: Studeanttaid searvvis ledje máŋggas, geat maŋŋil šadde guovddáš olmmožin sámi skuvllas ja kultureallimis, nugo Nils ja Laila Jernsletten, Thorleif Berg, Kristian Nymo, Anna Mørk ja Isak Østmo.

source: I den tiden måtte lærere som hadde vanlig lærerutdanning og tok tilleggsutdanning søke skolestyret om å få godkjent adjunktkompetanse.
sme: Dan áigge galge oahpaheaddjit, geain lei dábálaš oahpaheaddjioahppu ja geat válde lassioahpu, ohcat skuvlastivrras oažžut adjunktagelbbolašvuođa dohkkehuvvot.

source: Etter bestått samisk grunnfag søkte Randi om å få adjunktkompetanse.
sme: Maŋŋá go sámegiela vuođđofága cevzzii, de Randi ozai oažžut adjunktagelbbolašvuođa dohkkehuvvot.

source: Skolesjefen innstilte på avslag, og skolestyret sa nei.
sme: Skuvlahoavda árvalii biehttalit ohcamuša, ja skuvlastivra mieđihii dasa.

source: De mente samisk ikke var et undervisningsfag, og derfor ikke telte i skolen.
sme: Sii oaivvildedje ahte sámegiella ii lean oahpahusfága, ja danin ii lohkkojuvvon buorrin skuvllas.

source: Randi anket til Skoledirektøren og fikk støtte.
sme: Randi váidalii Skuvladirektevrii ja doppe oaččui doarjaga.

source: Men skolesjefen ga seg ikke og anket saken til departementet.
sme: Muhto skuvlahoavda ii vuollánan ja váidalii ášši departementii.

source: Etter vedtak i departementet fikk hun endelig godkjenning.
sme: Departemeantta mearrádusa vuođul de oaččui viimmat dan dohkkehuvvot.

source: Dermed var det slått fast fra høyeste hold at samisk var en kompetanse som skolen trengte.
sme: De lei celkojuvvon bajimuš dásis ahte sámegiella lei gelbbolašvuohta man skuvla dárbbašii.

source: Men ennå skulle det gå flere år før faget kom på timeplanen i grunnskolen.
sme: Muhto ain galge mannat ollu jagit ovdalgo fága iđii vuođđoskuvlla diibmoplánii.

source: Samisk for norsken sin del
sme: Sámegiella dárogiela nannema várás

source: Da det ble åpnet for samisk begynneropplæring, var det stor skepsis blant mange foreldre.
sme: Go beassagohte oahpahit sámegiela álgodásis, de váhnemat eai lean nu mielas dasa.

source: Da skoledirektøren sendte ut skriv om dette, argumenterte han med at samiskundervisningen var for å styrke norsklæringen.
sme: Go skuvladirektevra sáddii čállosa dán birra, de ákkastalai ahte sámegieloahpahus lei dárogiela nannema várás.

source: Selv om mange mente det å lese og skrive samisk hadde en egenverdi, var norsklæring ennå det eneste anerkjente målet.
sme: Vaikko ollugat oaivvildedjege ahte lohkat ja čállit sámegiela lea iešalddis mávssolaš, de lei dárogiela oahppan ain áidna dohkkehuvvon mihttun.

source: Trygve og Randi arbeidet begge på Karasjok barneskole da samisk begynneropplæring starta i 1967.
sme: Trygve ja Randi barggaiga goappašagat Kárášjoga mánáidskuvllas go sámegiela álgooahpahus álggahuvvui 1967:s.

source: Det var bare 7 elever som fikk opplæring på samisk første året, alle var fra kirkestedskretsen.
sme: Ledje 7 oahppi, geat ožžo sámegiela oahpahusa vuosttaš jagi, buohkat gulle márkanbirii.

source: Trygve hadde klassen i samisk, Randi hadde den i norsk.
sme: Trygve oahpahii sidjiide sámegiela, Randi gis dárogiela.

source: Det var ikke bare samiskundervisningen som var noe nytt, men også at norsk skulle undervises som det fremmedspråket det var for elevene, ikke som noe de «burde» forstå.
sme: Ii lean dušše sámegieloahpahus mii lei ođas, muhto maiddái ahte dárogiella galggai oahpahuvvot amasgiellan nugo dat lei ohppiide, dárogiella ii oahpahuvvon juonin man sii «berrejedje» áddet.

source: [Trygve Madsen forteller mer om dette i artikkelen Om sameskolen i Norge, som står i Samisk skolehistorie 1.]
sme: [Trygve Madsen muitala eambbo dán birra artihkkalis Norgga sámeskuvlla birra, girjjis Sámi skuvlahistorjá 1.]

source: Karasjok kommune fikk tidlig ungdomsskole, og fikk oppleve de skiftende ordningene for organisering av ungdomsskolen.
sme: Kárášjoga gildii ásahuvvui áigá jo nuoraidskuvla, ja sii besse vásihit nuppástuhtti ortnegiid ahte mo nuoraidskuvla galggai organiserejuvvot.

source: – Det verste var perioden med kursplaner.
sme: – Váigadeamos lei kursaplánaáigodat.

source: Foreldra valgte som regel laveste kursplan, de trodde ikke ungene ville klare mer.
sme: Váhnemat dábálaččat válljejedje vuolimus kursaplána, eai sii navdán mánáideaset nagodit eambbo.

source: I andre miljøer der foreldrene hadde mer ambisjoner for ungenes skolegang, valgte de høyere kursplan, selv om elevene ikke var særlig flinke.
sme: Eará birrasiingis váhnemiin ledje eambbo vuordámušat mánáidasaset, ja válljejedje bajimuš kursaplána, vaikko vel oahppit eai lean nu čeahpit.
